 In this video we are going to learn how to expand or we can say how to simplify the given set of algebraic factors. For example, let us say I have X -1 into do X -2. What would be the usual process this? First of all, I would mutliply  this x to this x to get x squared. And I will mention the equal to sign. Then I will multiply this x with this -2 to get minus two x. Then I would be mutliplying this -1 with this X to get minus x and then I would multiply this -1 with this -2 to get plus 2. Later, the next step, x squared is as it is. Minus 2 x and minus x makes minus 3x. Plus 2. And the process is really easy, and we could do it in a fairly simple way. There are only two factors that are multiplied so we could follow this process. But what if we had some three or four factors to multiply. Let us say I have one more over here. Like say x minus 3. Then what I would have to do is, I would have to put a bracket over here and I would have to continue multiplying this corresponding things. Which effectively means that I would have reached until this step and then I would have to perform similar operations with these two. Now, here we have only two terms in one bracket and another two terms in this bracket. Here we are in three terms in first bracket and two terms in the other. And you will see that as we move down, as the number of factors increases, the number of terms that has to multiply also goes up. This makes things really complicated. So, there is an easy way to evaluate this hassle. Let us see how. Here, let us generalize this entire process first. We will derive our results and then see how this actually works. First of all, here the first vector is in the form of and the other is in form of cx plus d and the third is in the form of ex plus f. 

First I will deal with this part. Okay. ax into cx is equal to a c x squared. Plus b into cx is b c x plus b into d. This forms first bracket and mutliplied by sorry ex plus f. Fine. Now, simplifying this further, I will get ac x squared plus 
And then I get ex plus f. Now this thing you need to remember. I will stop over here. 
Let's say I have 2x plus 1 into 5x plus 3. What is a into c? a is a coefficient of x and c is also a coefficient of x. 
The highest power will be x squared. And what would be its coefficient? 
Fine.
Then plus, the next lower power will be x. 
a is a coefficient of x multiplied by a constant part, that is a part that is not
So it's like take the coefficient of x that is 
Coefficient of x is two. Multiplied by 3 is 6. 
So this is it. 
Then b into c. What is b? A constant part over here. Sorry.
We just change the colo.r
It does not have any coefficient, or it does not have x along with it. 
This should be the simplified form of this. Let us do it with our usual method. 
2x plus 1
If you can see, we can simplify this furhter 
So you are getting both 
You really don't need to. 

Let us see how this works even when you don't write the

See. 
You have a number like 5x minus 1 and 3x plus 2. Remember that here it is negative. Here there are two factors. So the highest 
Then, next power would be x. Okay. Now what would be its coefficient. 5, that is the coefficient of x in the first bracket. 
And then constant part of first bracket multiplied by 
Okay. 
Plus, now you have to multiply the two constant parts. 
So what we get is 15 x squared 
Just to verifyi yourself, 

And what if we have one more term of here?
We just saw earlier, 
But, rather than 

Three factors or four factors. So, I am not going to expand 
So let us understand the direct approach. 
Okay. Let's say I have 3x plus 1 and x plus 2 and 2x plus 1. 
When you are multiplying three factors each of them having one x. 

Okay. So you got the coefficient of x cubed now the next is x squared. 
Three into one is three. 
And then you multiply this term with .
Remember 
Three into one is three. 
You get three. 
Plus.
Then. 
You multiply coefficient of x from first bracket that of third. That is you get 6. Three into two is six. And six into two is twelve. And then you multiply the coefficient of x 
and then multiply that with the constant part of first bracket. So one into two is two, and 
So, what we did is 
Let us move a little bit further. Next highest power will be x. 
