[
    {
        "line": "We will start out looking at three different type of circuit components. And what is going to be important to us is that each component type is characterized by a relationship between the current i flowing through the component and the voltage v across the component. So here we have in the previous circuit we drew the components like this. And we say that there is some current i flowing into the component, and a voltage v across the component.  So different components will have different relationships between the current and the voltage. So, start with a simple component, which is a resistor. And we will draw a resistor with a symbol like this. Everybody's seen this. This is a resistor. There's a current coming in. There's some voltage across it. And, it is characterized by a parameter R, which is the resistance. And, R is measured in ohms. R ohm resistor. And, the important relationship between between v and i for a resistor is that v=iR.  Everybody knows that as ohm's law. So, that's a resistor. Our next component is a voltage source. You can think of it as a battery or something like that. And we'll draw it with this symbol. It's a circle. It's a plus here and a minus there. And we will think of the currents as flowing in here and that there is a voltage across it like this. So that is as usual. And it has a parameter, which we will write V0, o for output. So, V, that is big V, o. That is measured in volts. And the relationship that a voltage source exerts on i and v is actually ignores i. It says that the voltage across this component, no matter what, is going to be V0. So, the voltage difference between here and here is Vo. And it says I don't care what the current is. In fact, if you go and buy a voltage source, its job is in fact to supply the current that would keep the voltage difference at V0. So, V0 is the voltage, and the current--there is still a current going through here; it's not that there is no current--but the voltage source leaves the current unconstrained. So, let me write that. i here, i for this guy is unconstrained.  Analogous to a voltage source, we have current source. The current source looks like this. We also draw it with a circle, but instead of the plus and minus inside, we have an arrow. And again we can say that there is some current going in, i. So, current flowing through the current source. And that there is a voltage across it. Same sort of thing. And the current being supplied I0, and I0 is measured in amps. And if we draw the picture like this, the way we've drawn it, then what this says is that the current, i, is constrained to be negative I0. Okay? And, it says I don't care what the voltage is, the voltage can be whatever it wants to, but I am going to cause that much current to come out. So, in this case v is unconstrained. Alright, so there we go. These are the three components that we are going to deal with.   ",
        "speaker": "narrator"
    }
]
