[
    {
        "line": "Now what we're going to do is see that the modularity and circuits really is not necessarily what you might expect. Let's consider a simple circuit that looks like this. We have a voltage source over here of 10 volts and it comes around here to a resistor divider. This and each of these resistors let say is 5 ohms and our current I looks like its going through this way and voltage one across here and voltage difference two across here.",
        "speaker": "narrator"
    },
    {
        "line": "And we know from previously looking at a resistor divider or voltage divider that V1, the voltage difference across this resistor is just the total voltage drop across here which is 10*5/(5+5) and we get 5 ohms.",
        "speaker": "narrator"
    },
    {
        "line": "OK, good, V1 is 5 and then we know that V2 has to be 5 of course. All right that all seems great but now what happens if I change the circuit a bit and what I'm going to do is I'm going to add something on it and in another color.",
        "speaker": "narrator"
    },
    {
        "line": "We made the circuit it was great, it was the divider, we found that we had...ops! 5 ohms, what am I doing? Terrible...not 5 ohms, it is 5 volts. OK, 5 volts, that's what I was doing I said I'm going to add something out of the circuit.",
        "speaker": "narrator"
    },
    {
        "line": "We built the circuit, we made a divider when we find out that we got 5 ohms right here at this node that seems like a useful thing.",
        "speaker": "narrator"
    },
    {
        "line": "And now we think, we're going to have 5 volts, I am going to do something with that 5 volts on bringing over here and going to run it through another resistor and I'm going to put that back it over here like this.",
        "speaker": "narrator"
    },
    {
        "line": "What happens when I add the green stuff in? When I add the green stuff in, well first of all it's no longer true that this current I is the current place of this resistors, I have to label this one, we get a new current I2, I'm going to call that.",
        "speaker": "narrator"
    },
    {
        "line": "And a different current here I3, and a new voltage here V3. Well, we know V3 is equal to V2 because of the way its setup but workers call it V3.",
        "speaker": "narrator"
    },
    {
        "line": "Now the question is what is going on here? What is the circuit like? One way to think about it is in particular what we're interested in is how does this affect? Does it change V1 and V2 at all phrases.",
        "speaker": "narrator"
    },
    {
        "line": "One thing that we can do is just applying some tricks we have already learn, we could see that this two resistors in parallel let this guy be 5 ohms also and we can rewrite this circuit, the circuit that has the green thing attached to it as an equivalent circuit that looks like this.",
        "speaker": "narrator"
    },
    {
        "line": "OK, well, we are now dependent on glitch let me reverse it next time again, and this 10 volts and it comes over here and we get.",
        "speaker": "narrator"
    },
    {
        "line": "What we were going to do, is see that this two 5 ohm resistors in parallel and two 5 ohm resistors in parallel is equivalent to remember that we take the...To compute this we take the product of the resistances like 5x5 is 25 and divide it by the sum which is 10.",
        "speaker": "narrator"
    },
    {
        "line": "An equivalent resistance here is 25 10's ohms right or 2.5 and the top resistor is still 5 ohms and I'm still interested in how V1 relates to V2.",
        "speaker": "narrator"
    },
    {
        "line": "OK, you see what I did, I took this circuit that we had before and looked at these bottoms two guys were in parallel, I said, 'Oh, resistors are in parallel, OK I know'.",
        "speaker": "narrator"
    },
    {
        "line": "There is an equivalent way to see resistors in parallel and I applied our formula that it is the product of the two resistances divided by the sum, that's why I got 2½ ohm resistor here as the equivalent resistance to these two parallel 5 ohm resistors.",
        "speaker": "narrator"
    },
    {
        "line": "OK, next thing I do is I go back and I see this as a voltage divider and if I go back and see this is a voltage divider, I say OK, V1=10 times and now it's 5 over 7.5 that's now equal to 6.66 volts.",
        "speaker": "narrator"
    },
    {
        "line": "That's interesting and V2 then has to equal 3.33 volts, what has gone on here, we've done what is known as a loaded circuit so we established a voltage here.",
        "speaker": "narrator"
    },
    {
        "line": "But by connecting another resistant to it we've actually changed the current that flows through those two resistors and therefore we have changed the actual voltage drop across the top resistor.",
        "speaker": "narrator"
    },
    {
        "line": "We gave...Another way to think about it is that we made it easier for the current to flow through here that actually gives us more of a voltage drop across here where we have more resistance and less of a voltage drop across here where we have more voltage drop where we have more resistance, less voltage drop where we have less resistance.",
        "speaker": "narrator"
    },
    {
        "line": "It's really important to remember that, when you build a circuit, until we get the buffers which we'll do next week when you build the circuit like this, even if you think you've analyzed it and you understand what the voltages are various places in the circuit.",
        "speaker": "narrator"
    },
    {
        "line": "When you attach another component to it, those voltages can all change. This phenomenon is going to come up a lot for us in the designs that we do, it's something we have to be careful and we referred to it with as loading the resistant divider here. Be careful, loading can change everything.",
        "speaker": "narrator"
    }
]