[
    {
        "line": "Hello, welcome. In this short video, let us look at the derivation of the estimators of the parameters of a uniform distribution using the method of moment.  Given the uniform distribution f(x) equals 1/(b-a), for random variable x between the values of a and b. That is, the value, x is in the interval a comma b.  Given this uniform distribution, we want to derive estimators for the parameters, a and b using the method of moments.  To start with, we derive the first two moments based on the PDF. That is, expectation of x is given by integral a to b, x*f(x)dx. Equal to integral a to b, (x*1/(b-a))dx. Equal to 1/(b-a)*(x^2/2), and the limits are a to b. Equal to (b^2-a^2)/(b-a).  Since b^2-a^2 equals (b-a)*(b+a), and the denominator is 2(b-a). Therefore clearly, we can cancel these (b-a) since a>b.  Therefore, E[x] equal to to the average of a and b, that is, (a+b)/2. This is equation one.  Now we do that with the second moment. Expectation of x^2 equal to integral a to b, x^2*f(x)dx. It's equal to integral a to b, x^2*(1/(b-a))dx which is equal to 1/(b-a)*(x^3/3), and the limits are a to b. Equal to the numerator is b^3-a^3, and the denominator is 3(b-a).  Since b^3-a^3 equals (b-a)*(b^2+a^2+ab we have the second moment, E[x^2} equals (a^2+b^2+ab)/3. This is equation two.  Now we note the expressions for the sample moment. That is the sample first moment is xbar, that is the mean. The sample mean equal to the 1/n summation i equals 1 to the n times xi. This is equation three.  The sample second moment designated as xbar with subscript two equal to 1/n, summation i equals 1 to the n times (xi)^2 . This is sample second moment. Equation four.  By using equations one to four, that is, E[x] equal to equating it to the sample mean. Equating the second moment, E[x^2] to the sample second moment. We have (a+b)/2 equals to xbar. Note that xbar are the mean, sample mean is given by equation three. For simplicity, we use this symbol.  We also have the E[x^2], that is, second moment defined as (a^2+b^2+ab)/3 equal to the sample second moment, xbar(2), the subscript two. Using these two equations, that is, solving the systems of the two equations, we can solve our a and b.  From equation five, that is, this equation we have a+b equals 2xbar, which basically means that a equals 2xbar, or two times the sample mean minus b. By plugging-in this value in the equation six, that is, a equals 2xbar-b in this equation six, we have (2xbar-b)^2+b^2+2(xbar-b)*b equal to three times sample second moment.  Expanding these terms, we have b^2+4xbar^2, that is square of the mean, minus 4b*xbar+b^2, that is this term. Then we have minus b^2, that is this term. Also we have plus 2b*xbar equal to 3*xbar(2).  Upon simplification, we have b^2, that is, this b^2 and this b^2 cancelled each other, we are left with b^2. Then we have minus 4b*xbar2b*xbar, which is minus 2b*xbar. Then we have 4*xbar^2-3xbar(2) equals 0.  If you look at this equation, this is basically a quadratic equation in b. Therefore, the value of b is given by b equal to minus b, that is, minus the quotient of the linear term, the quotient of the first part of the term. That is, minus 2xbar plus or minus square root of (b^2-4ac). That is, (2xbar)^2 minus four by one into this value, that is 4xbar^2-3xbar(2), that is the sample second moment.  This is the 2 times a, which is 2*1.  Under the assumption both a and b are positives, we have bhat equal to, this should be positive. We have bhat equal to xbar+sqrt(4xbar^2-4*4xbar^2+4*3xbar(2)), that is the sample second moment by two.  Therefore, the bhat is equal to... The estimator of b is given by xbar plus... This 4 can be taken outside, and it cancels with 2. We are left with 3xbar(2)-3xbar^2. This equal to sqrt(3*xbar(2)-3xbar^2). We have mean squared.  Therefore, this is the estimator of b. While using this relation, that is, a equals 2xbar-b, we also have an estimator, a. ahat equals 2xbar-bhat equals xbar-sqrt(3(xbar(2)-xbar^2)).  You can note that the value within the parenthesis is clearly the variance of the sample. That is, the difference between the second moment on square root of the mean, which is basically the variance of the sample.  Therefore, our uniform distribution variable should be random. The estimators of the unknown parameters a and b are given by combinations of mean and standard deviation of the sample. That is, ahat equal to the sample mean, xbar-square root of 3 times the standard deviation, S of the sample.  Similarly, bhat equal to xbar plus square root of three times the standard deviation of the sample. Therefore, the estimators of a and b are basically linear combinations of sample mean and sample standard deviation.  Thanks for watching.",
        "speaker": "narrator"
    }
]