[
    {
        "line": "We are going to prove some formulas from trigonometry, directly from Euler's formula, e^(ix) equals cos(x)+isin(x).  First, we are going to prove that sin^2(x)+cos^(x) equals 1. This can be proven from the Pythagorean theorem and the definitions of the trigonometric functions, but we are going to do it using Euler's formula. First, use the fact that e^(ix), we know that's cos(x)+isin(x). We also use the fact that, we've got e^(-ix) is e^i(-x) that's the same thing as cos(-x)+isin(-x). Furthermore, since cos is an even function, cos(-x) is cos(x), and since sin is an odd function, sin(-x) is negative sin(x). We write the negative out in front of the i. Next, we are going to multiply together these two equations right here. We have e^(ix)*e^(-ix) is equal to (cos(x)+isin(x)) times the quantity (cos(x)-isin(x)). Now, on the left hand side, we have the same base. These exponents we will add them together, get zero for an exponent, and e^0 is 1. On the right hand side, multiplying together the first two terms, we get cos^2(x). Multiplying together the outside terms, we get negative icos(x)sin(x). Then multiplying together the inside terms, we are going to get a isin(x)cos(x). Finally, multiplying together the two last terms, we are going to get a negative i^2 sin^2(x). Now, there is some great cancellation which happens, these two terms cancel out, and this negative i^2, i^2 is one, negative negative 1 is positive 1. What we are left with is 1 equals cos^2(x)+sin^2(x), which was exactly what we hoped to get up above. That's just the first way you can use Euler's formula to come up with a more algebraic proof. We will prove a few more results similarly. For instance, I'd like to prove the Angle Sum formulas. I have a hard time remembering these sometimes but that's a great reason to remember where formulas came from, and you can always rederive them for yourself. First, say we have e^(ia), that's cos(a)+isin(a). Also say we have e^(ib). That's cos(b)+isin(b). Now, just like before, we'll take these two equations and multiply them together e^(ia)*e^(ib) equals (cos(a)+isin(a))*(cos(b)+isin(b)). On the left, it's simplified. On the right, we'll get cos(a)*cos(b) plus we are going to multiply together the two last terms here. i^2 is negative 1. So, negative sin(a)sin(b) multiplying the interior terms, in the exterior terms, both are going to have a factor of i, cos(a)sin(b) we are going to write the i on the outside, now factoring that out, we have a sin(a)cos(b). Next, I am going to take Euler's formula and apply it directly to e^(i(a+b)). In that case we get cos(a+b)+isin(a+b). Now, interesting thing, when two complex numbers are equal, their real in their imaginary parts must also be equal, the real part, this first term is cos(a+b) which matches up with this part here. And the imaginary part is sin(a+b) which must therefore be equal to this part. If we write down these two results, we have the angle sum formulas. cos(a+b) is equal to cos(a)cos(b)-sin(a)sin(b). And we get the sum formula for sin as well. sin(a+b) is equal to  cos(a)sin(b)+sin(a)cos(b). Furthermore, if you want to get the double angle formulas, that's not too bad, if you let a equal x and b equal x then you will get cos(2x) that's x+x is equal to cos(x)cos(x) is cos^2(x), sin(x)sin(x) is sin^(x). And sin(2x). We are going to have cos(x)sin(x)+sin(x)cos(x). Both those terms are actually the same, so, you get 2sin(x)cos(x). Once more, Euler's formula proves to be a handy tool to have. ",
        "speaker": "narrator"
    }
]