[
    {
        "line": "  In the last video we considered some of the assumptions that are made when we consider the bigbang theory and there are two key assumptions. The first is the cause morjera principle which says that   on large enough scales large   scales the universe is   both homogeneous which means it looks the same at all points   and isotropic so there's no special directions in the universe. And our second assumption was that   all the laws of physics that we have studied and come to understand   are valid everywhere in the universe. And for the purposes of  stating the Big Bang probably the most important law   of physics is general relativity. And general to be is  Einstein's theory of gravity but incentive   describing gravity as a pulling force eisenstein describes gravity as   the effect love matter and energy actually   curving space-time. And   when you have a curved spacetime the curvature of that space time will   actually tell   matter in energy how to move and how to flow.   And in this picture one of the most important things is that   space is not just some fixed background   that matter and energy move around on. Rather   space-time will actually take a dynamical role   and involve rate along with matter and energy as the universal   so it's going to be very important for us to understand   the geometry of the space-time. So a good place to start from here   is saying well if the geometry of space is going to be so important   what kinds of geometrys can I have   that satisfy the cosmological principle? What kind of geometry is gonna have that are both   homogeneous and isotropic? And for the purposes   simplicity we're just going to you start by considering some   two-dimensional surfaces two dimensional spaces.   And by considering the spaces will learn the general properties that   some of these different geometries can have. And   the are very now very analogous cases to   three dimensional spaces your universe has three dimensions so   book the lessons we learned looking at two dimensional spaces   all right through to the 3d is to the first   tape up space that we can have is probably one that were most comfortable   with   the idea I love just say on infinite flat planes.  Let's just say I have some   plane that extends in all directions. So this is flat.  Its infinite in size. And all love the rules have geometry that we've   learned in grade school still applies. So if I draw   say a triangle on MySpace then   the angles of that triangle will add up   to 180 degrees is a rule that   we've probably all learning public school and probably familiar to most.  It still applies in this case. And we notice that   this space if it's a infinite extent   is homogeneous there's no special points on here.  And its isotropic there's no special directions. Now this isn't the only kind   of space that week.   For example we could consider the surface of a sphere   drugs year. And   this space will have different geometric properties.  So we would see that this piece is positively curved   positively curved. And we noticed that this space   is actually a finite space there's only so much   period so it's fine. But   even though it's a finite space it still has no way to if I were  a two-dimensional person living on this on this two-dimensional surface   I could walk around and around and never come into any boundary or anything. And if I look at my   you know general rules and geometry if I make a triangle   on this curved surface the triangle might look something like this.  And this triangle where each of these lines are following   straight lines on this curved space. If I   sum up the angle said the strike makes then   the angles will actually some up to you more than a hundred me degrees. So it's a very different kind of geometry than the flight geometry we're   used to. However this geometry is still   homogeneous and isotropic if I'm living on the server   on this surface there's no special points and there's no special directions   still satisfies the cosmological principle   now there's another table space that I can have and that is   a negative leakers space in this ones kinda difficult to draw so let's see how   I do it this   it kinda looks like this she a sample   so so we have the Sun or shade and we say this has   negative curvature negative the   occur this space like the   plane would be infinite incise   extending these directions 0 as far as you wanna go   but when I look at a a triangle on this shape   following straight lines on the skirt space the triangle might look something   like this     and the angles have that triangle would add up to you   less than a hundred need degrees. So again we have a different type   geometry with this geometry is also going to be   homogeneous and isotropic so it's still on the ballot possibility for   for the shipper for universe. Now there are   other geometry SEDAR that are out there that could exist   for instance I could have. And service fear I could have some sort of   egg shape but we notice when looking at this   X shape that the curvature at the at the very top of the egg   is going to be different than the curvature on the side of the eggs signs   of the eggs   are the Aggies much more flattened the very   in the very tip. So that means these two points   are going to be different and that goes against   our are a cosmological principle this space would not be homogeneous anymore   either   differences between spaces. So even though we could have   other geometries these are the only three   kinds of geometry that we can have for the universe   that are both homogeneous and isotropic. And in order to identify Witcher the shapes   actually describes our universe were alternately going to have to go   and measure something to you identify which type it is but we'll talk about   that sort of a thing later. Now looking at these two   curved geometry is you might be saying well   these can actually describe what the universe looks like I can you know   get to friends and a couple pieces a string in and go out and form a triangle   and measure the angles in a triangle in a notice that the land up to 180 degrees   like the flat plains. So this must be unambiguously what the shaoe universes is. And my response to that would be   if you look this at the surface   for instance this fear on very very small spaces   on very small scales then   this little patch will appear to be almost flat   for the same reason that people for hundreds of years thought that the earth   was flat. If you're only looking on small scales the   surface appear seems like. It's only when you kinda walk-on   larger scales that you realize that the year   is actually round so for all the surfaces. If you look on smaller scales will appear flat   but with modern technology and modern telescopes were actually able to see far   enough   to begin to test the kinda large-scale   properties the geometry of our universe.   So if this can a length scale   is on the order of billions of light-years   then looking on scales like the earth and the solar system   you're not going to be able to notice the curvature space on the scales.  Now when working with these curved spaces   there's something that's very very important note   and is a source   love lot of confusion when it comes to talking about the geometry of the early   universe.  And that is the idea of when I   draw this picture just for kinda simplicity in   in our understanding of this geometry I draw it as   the two-dimensional surface love a three-dimensional sphere. And the truth is that if I have this   two-dimensional space I can completely describe   that two-dimensional space using only the properties on that surface without ever having to refer to   some third dimension volume this object or   or anything else. It can be completely on its own   perfectly valid two-dimensional space. And it is actually fairly easy to describe   mathematically.  Same with this other curb geometry. I can completely describe that   without ever referring to any higher dimensional space.  So when we start talking about universe   expanding and contracting what we're talking about is   I have this so homogeneous I'm isotropic geometry   and maybe that geometry start small.  And then that geometry expands   into some into some what we would call   larger geometry. There's more surface area here   than there is here. But what people often want to say   is that there is some higher dimensional space   that this object that this surface is expanding into. But I can describe a love the geometry   completely staying on this surface without   ever leaving the serface. A higher dimension   does not have to exist in order for this to be   a consistent theory. And when we talk   more about the expansion of the universe this is the kind of expansion   were talking about this geometry space itself   changing and if I have say two points on the surface   then shipping   brighter color then if I am cue   points on this surface then   as this space expands. Then these two points will appear to be   further apart it'll take longer for like to bounce back and forth. And this doesn't just happen for curved geometry. So I can have this plan   geometry   starting in a a somewhat kinda   compressed state you can say so so these two points are close together in   takes like certain amount of time to bounce between knows. But that geometry through general to be because we said that   in according to general to be space-time   can actually evolving changing based on the matter and energy that's in it. So this piece can actually expand   and these two points will be   further will be moved farther away from each other it'll take away   a longer amount of time to travel between those two points. But one of the important things to know when we're considering these expending   geometry is   is that we do not need to have   some higher dimension that this thing is expanding into. We don't have   compressed matter and empty space outside this is expanding into.  We can completely describe this simply as   the geometry this space is changing.  Only talking about only using on these   better on that geometry not anywhere   anywhere else here. So when people sometimes say that   the universe is expanding into something that's like saying   I have bar that has a certain amount of temperature   and that temperature is is increasing and what is that temperature increasing   into   when we talk about it that way this question what is the universe is   expanding into just   doesn't make sense anymore. So so that's   very important point that I really want to emphasize   their does not have to be some higher dimensional space at this is expanding   into. And we'll talk a little bit more about how the universe expands   and what's router fax the expansion of the universe has   in future videos ",
        "speaker": "narrator"
    }
]