[
    {
        "line": "We are going to prove some formulas from trigonometry, directly from Euler's formula, e to the i x equals cos x plus i times sin x.  First, we are going to prove that sin squared of x plus cosine squared of x is equal to one. This can be proven from the Pythagorean theorem and the definitions of the trigonometric functions, but we are going to do it using Euler's formula. First, use the fact that e to the i x, we know that's cosine of x plus i times sine of x. We also use the fact that, we've got e to the negative i x is e to the i times negative x that's the same thing as cosine negative x plus i times sine negative x. Furthermore, since cosine is an even function, cosine of negative x is cosine of x, and since sin is an odd function, sin of negative x is negative sine of x. We write the negative out in front of the i. Next, we are going to multiply together these two equations right here. We have e to the i x times e to the negative i x is equal to cosine of x plus i times sine of x times the quantity cosine of x minus  i times sine of x. Now, on the left hand side, we have the same base. These exponents we will add them together, get zero for an exponent, and e to the zero is one. On the right hand side, multiplying together the first two terms, we get cosine squared x. Multiplying together the outside terms, we get negative i times cosine x times sine x. Then multiplying together the inside terms, we are going to get a plus i times sine x times cosine x. Finally, multiplying together the two last terms, we are going to get a negative i squared sin squared x. Now, there is some great cancellation which happens, these two terms cancel out, and this negative i squared, i squared is one, negative negative one is positive one. What we are left with is one equals cosine squared x plus sin squared x, which was exactly what we hoped to get up above. That's just the first way you can use Euler's formula to come up with a more algebraic proof. We will prove a few more results similarly. For instance, I'd like to prove the Angle Sum formulas. I have a hard time remembering these sometimes but that's a great reason to remember where formulas came from, and you can always re derive them for yourself. First, say we have e to i a, that's cosine a plus i times sine a. Also say we have e to the ib. That's cosine b plus i sine b. Now, just like before, we'll take these two equations and multiply them together e ia, e ib equals cosine a plus i sine a times the quantity cosine b plus i sine b. On the left, it's simplified. On the right, we'll get cosine a times cosine b plus we are going to multiply together the two last terms here. i squared is negative one. So, negative sine a sine b multiplying the interior terms, in the exterior terms, both are going to have a factor of i, cosine a sine b we are going to write the i on the outside, now factoring that out, we have a sine a cosine b. Next, I am going to take Euler's formula and apply it directly to e to the i a plus b. In that case we get cosine the quantity a plus b plus i times sine quantity a plus b. Now, interesting thing, when two complex numbers are equal, their real in their imaginary parts must also be equal, the real part, this first term is cosine a plus b which matches up with this part here. And the imaginary part is sine a plus b which must therefore be equal to this part. If we write down these two results, we have the angle sum formulas. cosine of a plus b is equal to cosine a cosine b minus  sine a sine b. And we get the sum formula for sine as well, sin of a plus b is equal to  cosine a sine b plus sine a cosine b. Furthermore, if you want to get the double angle formulas, that's not too bad, if you let a equal x and b equal x then you will get cosine two x that's x plus x is equal to cosine x times cosine x is cosine squared x, sin x times sin x is sine squared x. And sin of two x. We are going to have cosine x sin x plus sin x cosine x. Both those terms are actually the same, so, you get two sin x cosine x. Once more, Euler's formula proves to be a handy tool to have. ",
        "speaker": "narrator"
    }
]